{
    "header":"Relational Database Modeling",
    "about":"Made in 2019 as the final project of the Databases I university discipline, this project encompasses the modeling of a relational database from the idealization of the project in which it will be inserted through the conceptual, logical models to the physical using MySQL.",
    "projectStatus":"Project Finished",
    "projectRepo":"Go to Repository",
    "requirementsHeader":"Project Requirements",
    "requirementsDescription":"As it is a final course project, this project has several technical requirements in its various modeling stages, especially regarding the SQL script in its physical model, namely:",
    "requirementsListItem_1":"Introduction: description of the database purpose. The introduction contains information about the reality that was modeled with a detailed description of the business rules and the definition of the project scope.",
    "requirementsListItem_2":"Conceptual Scheme:  With the brModelo tool an E-R (Entity-Relationship) diagram was modeled containing the maximum and minimum cardinalities of each relationship using Peter Chen's notation.",
    "requirementsListItem_3":"Logical scheme: the normalized relational diagram containing the maximum and minimum cardinalities of each relationship was modeled using the crow's foot notation with MySQL Workbench.",
    "requirementsListItem_4":"Data Dictionary: made in order to describe tables and their attributes in order to detail their type, description, if it can receive null values, the origin domain and if the attribute is a foreign or primary key.",
    "requirementsListItem_5":"Creation Script: Separated script for creating project tables written using SQL.",
    "requirementsListItem_6":"Population Script: A separate script for populating the project's tables must have a minimum amount of data necessary for the use of the query script.",
    "descriptionHeader":"Description",
    "descriptionBody":"Represents a fantasy RPG game database, in this game it is determined that players can interact, do quests, obtain achievements, lead and be part of a guild that may or may not have alignment and other common entities and relationships in a fantasy RPG game that are described in greater detail in the minimundo file.",
    "conceptHeader":"Conceptual Model",
    "conceptDesciption":"The conceptual schema meets the following technical requirements.",
    "conceptListItem_1":"Weak entity with identifier relationship",
    "conceptListItem_2":"Associative entity (aggregation)",
    "conceptListItem_3":"Specialization structure with a table for each entity",
    "conceptListItem_4":"N:N Relationship",
    "conceptListItem_5":"1:1 Relationship",
    "conceptListItem_6":"Relationship with attributes",
    "conceptListItem_7":"Ternary relationship",
    "conceptListItem_8":"Self-Relationship",
    "conceptListItem_9":"Multivalued Attribute",
    "conceptListItem_10":"Composite Attribute",
    "imgDescription_1":"Entity-Relationship Model",
    "imgDescription_2":"Logical Model",
    "imgDescription_3":"Data dictionary",
    "physicalmodelHeader":"Physical Model (Creations, Inserts, Updates)",
    "physicalmodelDesciption":"Creation, Inserts and Updates Script meets the following technical requirements.",
    "physicalmodelList_1_Item_1":"(Creation) Use of the CHECK constraint (minimum of 3, different)",
    "physicalmodelList_1_Item_2":"(Creation) Use of the UNIQUE constraint",
    "physicalmodelList_1_Item_3":"(Creation) Use of the FOREIGN KEY constraint",
    "physicalmodelList_1_Item_4":"(Creation) Using the DEFAULT constraint",
    "physicalmodelList_1_Item_5":"(Population) Insert at least 5 rows in each table",
    "physicalmodelList_1_Item_6":"(Update) Update a field",
    "physicalmodelList_1_Item_7":"(Update) Multiple Field Update",
    "physicalmodelList_1_Item_8":"(Update) Delete data with condition in at least two tables",
    "imgDescription_4":"Physical Model",
    "queryHeader":"Physical Model (Queries)",
    "queryDesciption":"Query Script with commented results, require the use of the following clauses"
}