{
    "header":"Portfolio",
    "about":"Since I already had solid knowledge about ECMAScript6/HTML5/CSS tools in 2021 I built this project with three objectives: master the basic functionalities of ReactJS/JSX and SASS for its use in future projects, enter the professional development market software and show my friends and family the projects I've been working on",
    "projectStatus":"Project Finished",
    "projectRepo":"Go to Repository",
    "descriptionHeader":"Project Structure",
    "description": "The Project is divided into two types of pages: the Portfolio, which is the main page, and the project pages, which despite being several pages, their internal functioning and layout is very similar, but not enough to use a single page for all.",
    "imgDescription_1":"Simplified Project Structure",
    "pagesHeader":"Project Pages",
    "mainPageHeader":"Main Page",
    "mainPage":"It has its own About, Contact and Projects modules, makes use of support modules that are also present in the project pages.",
    "projectPageHeader":"Project Page",
    "projectPage":"Simple page of projects with each project being able to have its different documentation it is necessary to display different pages for this reason each project has its unique page, and just as mainPage uses support modules common to both, however it has a script with functions shared by the project pages.",
    "imgDescription_2":"Function sharing on project pages",
    "supportModHeader":"Support Modules",
    "supModMain": "Shared between the project pages and the main page, the support modules are 3:",
    "navBarHeader": "NavBar",
    "navBar": " Adapts and helps the navigation inside the page and between pages, changes application display states such as dark mode and displayed language.",
    "dynamicIMGHeader":"DynamicIMG",
    "dynamicIMG":" Used exclusively to return an img with the svg corresponding to a string passed as a parameter, being able to apply properties and style to the returned img.",
    "imgDescription_3":"Behavior of DynamicIMG",
    "transitionsHeader":"Effects",
    "transitionsAbout":" Responsible for transition effects when loading a page, interacting with a module, switching language and changing light/dark display styles. every applied effect use react hooks from main component."
}