{
    "header": "Synonyms Detection Framework",
    "about":"Made in 2019 as a Data Structures discipline project, this project aimed to create a framework capable of loading data from a csv file and from it generate statistical data and perform searches capable of detecting synonyms of what is searched.",
    "projectStatus":"Project Finished",
    "projectRepo":"Go to Repository",
    "loadHeader":"Database Load",
    "loadDescription": "The loading part is done by the CreatDicionario() function, this function uses the python csv library, it opens the csv file with approximately 1600 untreated records and for each record of the csv file a data dictionary is created accordingly.",
    "statisticsHeader":"Statistical Data about the Database",
    "statisticsDescription":"The generation of statistical data depends only on the statistics() function that takes as an argument the list of data dictionaries currently loaded, which if not loaded will return an error message. if this list exists, the function returns to the user the number of records, number of words, percentage of Graduations, Specializations, Masters, Doctorates and Post-Doctors.",
    "imgDescription_1": "Result of generating statistical data",
    "searchFrameworkHeader": "Search Framework",
    "searchFrameworkListHeader": "Search options based on the following keys are displayed:",
    "searchFrameworkListIten_1":"Graduation",
    "searchFrameworkListIten_2":"Specialization",
    "searchFrameworkListIten_3":"Masters",
    "searchFrameworkListIten_4":"Doctorate",
    "searchFrameworkListIten_5":"Post doctoral",
    "searchFrameworkDescription_1":"After the user informs the desired qualification, another input expects to receive a string that will be used as a filter for the qualification field of all records.",
    "searchFrameworkDescription_2":"With the qualification key and the string with knowledge area, a function goes through all the loaded records using an implementation of damerau levenshtein edit distance to compare the informed string with each string stored in the qualification array whose key was informed.",
    "imgDescription_2":"Damerau–Levenshtein distance definition",
    "searchFrameworkDescription_3":"The comparison is made ignoring characters with accents and with all characters of both strings in uppercase, and finally, if the result of the comparison presents an acceptable similarity between both strings, the curriculum is inserted at the end of a list that is returned to the user.",
    "imgDescription_3":"Search result",
    "aboutFuncHeader":"About",
    "aboutFuncDescription":"The about option explains in more detail the inner workings of the project, from the structure of the dictionary used by the records to the detailed description of project functions.",
    "imgDescription_4":"About Menu"
}