{
    "header": "Visar Livros",
    "about":"Made in 2019 using HTML, CSS, Javascript, Bootstrap and Babeljs as the script languages course final project, it is a web page integrated with the google books API, it allows the user to perform searches based on title, author, publisher or book genre.",
    "projectStatus":"Project Finished",
    "projectRepo":"Go to Repository",
    "projReqHeader":"Functional requirements",
    "projReq_Item_1_header":"Use of functional programming",
    "projReq_Item_1_about":"All project scripts interact with the page almost exclusively through functions.",
    "projReq_Item_2_header":"Creating dynamic components",
    "projReq_Item_2_about":"Both the component that displays the results and the one that displays a book are dynamic where they both receive different data from a book or set of books according to what the user searches or selects.",
    "projReq_Item_3_header":"Use of the FETCH API and JSON",
    "projReq_Item_3_about":"When loading the page, it makes use of the fetch API to load a JSON with information from a set of books and insert it into the page's html code.",
    "projReq_Item_4_header":"Usage of RegExp",
    "projReq_Item_4_about":"Uses regular expressions to remove html tags that can often be contained in book information.",
    "projReq_Item_5_header":"JS Packages Usage",
    "projReq_Item_5_about":"It makes use of babeljs to transpile the modern javascript code used in the project into old version javascript code so that the scripts run smoothly in older browsers.",
    "projReq_Item_6_header":"Webpack Modules Usage",
    "projReq_Item_6_about":"It makes use of 2 modules, pushcard.js which exports functions responsible for receiving, processing and inserting JSON data into the page's html code, and search.js which exports functions responsible for performing google books searches of whatever is searched.",
    "featuresHeader":"Features",
    "featuresAbout":"It is a single page application, that is, it uses an HTML page that is modified as the user uses it, although it uses the bootstrap CSS framework and has its own style sheet.",
    "imgDescription_1":"Search Module",
    "featuresDescription_1":"The search returns a JSON with multiple records that contain information about books, these records are mapped so that each book turns into a card with an image, title and shortened description.",
    "imgDescription_2":"Results module on page load",
    "featuresDescription_2":"When clicking on a card, another request is made to the google books API that returns all the book's data, this data is inserted into a modal that will contain the title, authors, genres, description and link to the book's page on google books.",
    "imgDescription_3":"Detailed view of a book card",
    "featuresDescription_3":"Despite making use of the bootstrap framework, it has its own style sheet to ensure responsiveness from 350px to 4k.",
    "imgDescription_4":"Page display on 350px width",
    "runHeader":"Running the Project Locally",
    "runListItem_1":"Must have installed git from version 2.2 and nodejs from version 12.",
    "runListItem_2":"In a preferred location, clone the repository using the git clone command.",
    "runListItem_3":"Open a terminal and Navigate to cloned directory.",
    "runListItem_4":"In the terminal run the command npm install to install the project's dependencies.",
    "runListItem_5":"Still in the terminal run the command npm start to upload the project locally."
}