{
    "header":"Modelagem de Banco de Dados Relacional",
    "about":"Feito em 2019 como projeto final da disciplina de Banco de Dados 1 esse projeto engloba a modelagem de um banco de dados relacional desde a idealização de como seria o minimundo em que será inserido passando pelos modelos conceitual, lógico até chegar ao físico usando MySQL.",
    "projectStatus":"Projeto Finalizado",
    "projectRepo":"Ir ao Repositório",
    "requirementsHeader":"Requisitos do Projeto",
    "requirementsDescription":"Por se tratar de um projeto final de disciplina, este projeto possúi vários requisitos técnicos em suas diversas etapas de modelagem especialmente quanto ao script SQL em seu modelo físico, sendo eles:",
    "requirementsListItem_1":"Introdução: descrição da finalidade do banco de dados. A introdução deverá conter as informações da realidade a ser modelada (minimundo) com a descrição detalhada das regras de negócio e a definição do escopo do projeto.",
    "requirementsListItem_2":"Esquema Conceitual: Foi modelado diagrama E-R (Entidade-Relacionamento) contendo as cardinalidades máxima e mínima de cada relacionamento onde foi Uilizada a notação de Peter Chen com o brModelo.",
    "requirementsListItem_3":"Esquema lógico: foi modelado o diagrama relacional normalizado contendo as cardinalidades máxima e mínima de cada relacionamento onde foi utilizado a notação crow's foot (IE) com o MySQL Workbench.",
    "requirementsListItem_4":"Dicionário de Dados: feito de modo a descrever tabelas e seus atributos de forma a detalhar seu tipo, descrição, se pode receber valores nulos, o domínio de origem (em caso de chave estrangeira) e se o atributo é chave estrangeira our primária.",
    "requirementsListItem_5":"Script de Criaçao: Sript separado para criação das tabelas do projeto.",
    "requirementsListItem_6":"Script de Povoamento: Um sript separado para o povoamento das tabelas do projeto, deve possuir uma quantidade mínima de dados necessários para o uso do script de consultas.",    "descriptionHeader":"Minimundo",
    "descriptionBody":"Representa a descrição de um banco de dados de um jogo de fantasia RPG, nesse jogo é determinado que os jogadores podem interagir, fazer missões, obter conquistas, chefiar e fazer parte de uma guilda que pode possuir ou não alinhamento e outras entidades e relações comuns em um jogo de fantasia RPG que são descritos em maior detalhe no arquivo completo com o minimundo.",
    "conceptHeader":"Modelo Conceitual",
    "conceptDesciption":"O esquema conceitual atendem aos seguintes requisitos técnicos.",
    "conceptListItem_1":"Entidade fraca com relacionamento identificador",
    "conceptListItem_2":"Entidade associativa (agregação)",
    "conceptListItem_3":"Estrutura de especialização com uma tabela para cada entidade",
    "conceptListItem_4":"Relacionamento N:N",
    "conceptListItem_5":"Relacionamento 1:1",
    "conceptListItem_6":"Relacionamento com atributos",
    "conceptListItem_7":"Relacionamento ternário",
    "conceptListItem_8":"Auto-Relacionamento",
    "conceptListItem_9":"Atributo Multivalorado",
    "conceptListItem_10":"Atributo Composto",
    "imgDescription_1":"Modelo Entidade-Relacionamento",
    "imgDescription_2":"Modelo Lógico",
    "imgDescription_3":"Dicionário de Dados",
    "physicalmodelHeader":"Modelo Físico (Criação, Povoamento, Atualização)",
    "physicalmodelDesciption":"O Script de criação, povoamento e Atualização atende os seguintes requisitos técnicos.",
    "physicalmodelList_1_Item_1":"(Criação) Uso da constraint CHECK (mínimo de 3, diferentes)",
    "physicalmodelList_1_Item_2":"(Criação) Uso da constraint UNIQUE",
    "physicalmodelList_1_Item_3":"(Criação) Uso da constraint FOREIGN KEY",
    "physicalmodelList_1_Item_4":"(Criação) Uso da constraint DEFAULT",
    "physicalmodelList_1_Item_5":"(Povoamento) Inserção pelo menos 5 linhas em cada tabela",
    "physicalmodelList_1_Item_6":"(Atualização) Update de um campo",
    "physicalmodelList_1_Item_7":"(Atualização) Update de múltiplos campos",
    "physicalmodelList_1_Item_8":"(Atualização) Exclusão de dados com condição em pelo menos duas tabelas",
    "imgDescription_4":"Modelo Físico",
    "queryHeader":"Modelo Físico (Consultas)",
    "queryDesciption":"O Script de consultas com suas respostas comentadas, tendo como requisito o uso das seguintes cláusulas:"

}