{
    "header":"Portfolio",
    "about":"Uma vez que eu já tinha conhecimento sólido a respeito das ferramentas ECMAScript6/HTML5/CSS em 2021 construí esse projeto com três objetivos domínio das funcionalidades básicas do ReactJS/JSX e SASS para seu uso em projetos futuros, me inserir no mercado profissional de desenvolvimento de software e mostrar aos meus amigos de faculdade e familiares os projetos que tenho trabalhado",
    "toolsHeader":"Ferramentas",
    "projStatusHeader":"Info",
    "projectStatus":"Finalizado",
    "projectRepo":"Ir ao Repositório",
    "descriptionHeader":"Estrutura do projeto",
    "description": "O Projeto é dividido em dois tipos de páginas: a Portfolio que é a página principal e as páginas de projeto, que apesar de serem várias páginas seu funcionamento interno e layout é muito semelhante todavia não o suficiente para seja utilizado uma unica página para todos.",
    "imgDescription_1":"Estrutura Simplificada do Projeto",
    "pagesHeader":"Páginas Projeto",
    "mainPageHeader":"Página Principal",
    "mainPage":"Possui os módulos próprios About, Contact e Projects, faz uso de módulos de suporte que estão presentes também nas páginas de projetos.",
    "projectPageHeader":"Páginas de Projetos",
    "projectPage":"Página simples de projetos com cada projeto podendo ter sua documentação diferente é necessário exibir páginas diferentes por isso cada projeto tem sua página única, e assim como a página principal utiliza módulos de suporte comuns a ambos, porém possui um script com funções compartilhadas pelas páginas de projetos.",
    "imgDescription_2":"Compartilhamento de funções nas páginas dos projetos",
    "supportModHeader":"Módulos de Suporte",
    "supModMain": "Compartilhados entre as páginas de projeto e a página principal os módulos de suporte são 3:",
    "navBarHeader": "NavBar",
    "navBar": "Se adapta e auxilia a navegação interna da página e entre as páginas, altera estados de exibição da aplicação como modo noturno e linguagem exibida",
    "dynamicIMGHeader":"DynamicIMG",
    "dynamicIMG":"Usada exclusivamente para retornar uma img com o svg correspondente a uma string passada como parametro, sendo capaz de aplicar propriedades e estilo a img de retorno.",
    "effectsHeader":"Effects",
    "effects":"Responsável por efeitos de animação ao carregar uma página, interagir com um módulo, trocar linguagem e alterar os estilos de exibição claro/escuro",
    "imgDescription_3":"Funcionamento do DynamicIMG"
}