{
    "header": "Visar Livros",
    "about":"Feito em 2019 usando HTML, CSS, Javascript, Bootstrap e Babeljs como projeto final da disciplina de linguagens de script, trata-se de uma página web integrada a API de livros do google, permite que o usuário realize buscas baseadas em título, autor, editora ou gênero de um livro.",
    "projectStatus":"Projeto Finalizado",
    "projectRepo":"Ir ao Repositório",
    "projReqHeader":"Requisitos funcionais do projeto",
    "projReq_Item_1_header":"Uso de programação funcional",
    "projReq_Item_1_about":"todos os scripts do projeto interagem com a página quase que exclusivamente através de funções.",
    "projReq_Item_2_header":"Criação de componentes dinâmicos",
    "projReq_Item_2_about":"Tanto o componente que exibe os resultados quanto o que exibe um livro são dinâmicos onde ambos receber diferentes dados de um livro ou conjunto de livros de acordo com o que o usuário pesquisa ou seleciona.",
    "projReq_Item_3_header":"Uso do FETCH API e JSON",
    "projReq_Item_3_about":"Ao carregar a página, faz uso do fetch API para carregar um JSON com as informações de um conjunto de livros e inseri-los no código html da página.",
    "projReq_Item_4_header":"Uso de RegExp",
    "projReq_Item_4_about":"Usa de expressões regulares para remover tags html que geralmente podem estar contidas nas informações de um livro.",
    "projReq_Item_5_header":"Uso de pacotes do JS",
    "projReq_Item_5_about":"Faz uso do babeljs para transpilar o código javascript moderno usado no projeto para um código javascript em uma versão antiga de modo que os scripts sejam executados sem problemas em navegadores mais antigos.",
    "projReq_Item_6_header":"Uso de módulos com Webpack",
    "projReq_Item_6_about":"Faz uso de 2 módulos, pushcard.js que exporta funções responsáveis por receber, tratar e inserir dados de um JSON no código html da página, e search.js que exporta funções responsáveis por realizar as buscas google books do que for pesquisado.",
    "featuresHeader":"Características",
    "featuresAbout":"Trata-se de uma single page application ou seja faz uso de uma página HTML que é modificada conforme o usuário a usa, apesar de fazer o uso do framework de CSS bootstrap possui folha de estilos própria.",
    "imgDescription_1":"Módulo de pesquisa",
    "featuresDescription_1":"A pesquisa retorna um JSON com múltiplos registros que contêm informações sobre livros, esses registros são mapeados de modo que cada livro se transforma em um card com imagem, título e descrição reduzida.",
    "imgDescription_2":"Página de resultados em estado inicial",
    "featuresDescription_2":"Ao clicar em um card é feita outra requisição à API do google books que retorna todos o dados do livro, esses dados são inseridos em um modal que irá conter o título, autores, gêneros, descrição e link para a página do livro no google books.",
    "imgDescription_3":"Exibição detalhada de um livro",
    "featuresDescription_3":"Apesar de fazer o uso do framework bootstrap possui folha de estilos própria de forma a garantir responsividade de 350px até 4k.",
    "imgDescription_4":"Exibição da página com 350px",
    "runHeader":"Executando o Projeto localmente",
    "runListItem_1":"Tenha instalado o git a partir da versão 2.2 e o nodejs a partir da versão 12.",
    "runListItem_2":"Em um local de preferência clone o repositório usando o comando git clone.",
    "runListItem_3":"Abra um terminal e Navegue até diretório clonado.",
    "runListItem_4":"No terminal execute o comando npm install para instalar as dependências do projeto.",
    "runListItem_5":"Ainda no terminal execute o comando npm start subir o projeto localmente."
}